{"views": "6,638", "comments": [{"replies": [{"author": "lorgon111 - Brian's Minecraft & More!6 months ago", "content": "+jahg1977 perhaps I shall call upon you at some point :)"}], "author": "jahg1977", "content": "I taught programming for fourteen years; I know the effort that goes into choosing what to say and what not to say, and I think you have done a grand job on this.\n\nI'm determined to learn this stuff.  Need a clueless assistant?  ;)"}, {"replies": [{"author": "Ouiguy Mike.6 months ago", "content": "+132ikl Is this the Krusty Krab?"}], "author": "ConeDodger240", "content": "Guess you're Dr. Professor Brian Lorgon111 now."}, {"replies": [{"author": "lorgon111 - Brian's Minecraft & More!6 months ago", "content": "+NerdyStarProductions great, thanks!"}], "author": "NerdyStarProductions", "content": "I think your style is perfect for both beginner and advanced users. As a programming student, I find that the slow paced teaching is essential for beginners who know next to nothing, but is also very beneficial for advanced users. The thing is, I find that even if I know most of the knowledge taught in a lesson, I always find that there tend to be many subtleties that tend to enhance your proficiency and critical thinking. \n\nFor example, in this video, I would say that I knew many of the things here. I'm relatively familiar with the basic commands, and if I had to choose between whether or not I needed to watch this video, I would say that I didn't need it. But I did still learn a lot of really useful tricks that I didn't know about. Things like auto complete coords, Ctrl middle click, and stopping the day cycle at 500 so you can easily identify direction without pulling up f3, are all very useful little tips and tricks that I don't really need, but will definitely make my command block programming much more efficient. \n\nIn any case, I love how this first video turned out. looking forward to watching more."}, {"replies": [null], "author": "Lucas Seltaeb", "content": "As for what I personally know, I found this Episode 1 (although I knew everything you said) very refreshing. As for actual command blocking, I know next to nothing. I know a few commands, but not really putting them into the blocks, and making magic happen. I am really hyped for this series! Way to to Brian! :D"}, {"replies": [{"author": "PeKlim2 months ago", "content": "+gaming turtle You must allow experimental versions in settings in minecraft loader. And after this You will be able to select snapshot versions."}], "author": "PeKlim", "content": "Yes, please!\nAnd if I may. I like to get info about differences between 1.8 and 1.9 where applicable, and possible. For example how do things without three types of command blocks."}, {"replies": [null], "author": "Anna “Momibelle” B.", "content": "Really great work, thanks so much. Am sharing a link to your tutorials to all of my kids and their parents in anticipation of Hour of Code. Cheers!"}, {"replies": [null], "author": "three_two", "content": "Great stuff Brian! A bit of feedback as more of an advance command block user: It would be interesting if you could divide the series into \"beginner\" and \"advanced\" learning sessions. I know that may be more trouble than it's worth for you but, just wanted to throw that out there. Regardless, I look forward to future episodes!"}, {"replies": [null], "author": "Zacc", "content": "If you want to use mobs in your creation make the gamerule doMobSpawning false instead of peaceful difficulty"}, {"replies": [null], "author": "KroH_", "content": "this is really easy to understand :) thank you"}, {"replies": [null], "author": "rallekralle11", "content": "i already knew basically everything in this video, but maybe i'll learn something new in the next one :)"}, {"replies": [null], "author": "JMC Minecraft", "content": "Thank you so much for making this series!!! I want to learn command block ages ago!!"}, {"replies": [{"author": "cdinprov6 months ago", "content": "lol that makes two of us Blur :p"}], "author": "Blu Rakkun", "content": "Neat! You make a great teacher :). I think you structured this very well.\n\nAlso, 'iterative deepening' made me giggle because I'm immature."}, {"replies": [null], "author": "Noah Larkin", "content": "I know quite a bit of command blocks already, but I'm watching this in case I have more to learn, like the tab-complete co-ordinates, didn't know of that. Though, shouldn't you do /gamerule doMobSpawning false | instead of | /difficulty 0?"}, {"replies": [null], "author": "scocraft", "content": "I, for one, enjoy lies and hope you include more of them in future tutorials.  The more outrageous, the better."}, {"replies": [null], "author": "cdinprov", "content": "Great Idea Brian! Will have to watch again later when my brain stops going wheee I got a job and can focus on other things :)"}, {"replies": [null], "author": "Gretgor LOL", "content": "Brian, this is a great idea, and I fully support it! :D\n\nYou know what would be awesome? If you could give us some assignments at the end of each video so we can post the videos of our solved assignments and get mentioned in the next episode, like your loyal pupils or something :P"}, {"replies": [null], "author": "MonkeyDKS", "content": "I already know a lot about command blocks.  I've made quite a few (half-finished) mini games in minecraft, and I still managed to learn a few new tricks in this episode!  This is great, keep it up!"}, {"replies": [null], "author": "Minstorm34", "content": "I like how you started from the beginning knowledge level, because even though I have been using command blocks since they were added, I still learned a few things (mainly the control-pick block and that coordinates can autofill)."}, {"replies": [null], "author": "Aniline_Selenic", "content": "Thanks for taking the time to make this series. With the changes to command blocks in 1.9, I figured it would be a good time to start learning them, but I had trouble finding many tutorials. Those that I did find, mainly focused on basics without going any deeper. I'm looking forward to more of your videos, especially once you get deeper into command blocks."}, {"replies": [null], "author": "MrVerece", "content": "Great tutorial Brian :D\nWould be great to maybe mark the texts of F3 mode in colors so that one can find it quicker as you explain stuff"}], "author": "lorgon111 - Brian's Minecraft & More!", "extracted": "2016-03-12 11:14:05.613999", "description": "Published on Aug 27, 2015\nI'll teach you Minecraft command block programming! This series will help you learn step-by-step using the 1.9 snapshots of Minecraft for PC.\n\nThis episode covers\n- creating an appropriate world environment for command block programming\n- the basics of absolute versus relative coordinates\n- a few basic commands (/spawnpoint, /setworldspawn, /setblock)\n- a few important buttons/controls\n- obtaining your first command block\n\nTeaching programming to a wide audience is a challenge. I'll try to go at a slow, detailed pace that most viewers can follow. If you know a topic well, you might want to watch at 1.5x or 2x speed to skim.\n\nTeaching complicated subject matter is a challenge. During an episode, I sometimes do 'handwaving', or tell white lies or lies of omission, for simplicity to teach beginners. At the end of each epsiode, I'll have a segment where I try to clear up the lies I know I told, going into more gory detail.\n\nSubscribe for more videos & tutorials here:\n\nThis playlist:\n\nFollow me on twitter @lorgon111 :", "title": "Learning Minecraft Command Block Programming, Part 1 - Setup"}