{"views": "515,500", "extracted": "2016-03-12 11:12:21.685322", "author": "SethBling", "description": "Published on Jan 16, 2016\nI used command blocks to write a BASIC interpreter in vanilla Minecraft. You can use it to control Logo-like Turtles.\nDownload: http://sethbling.com/Scripting\n\nSethBling Twitter:\nSethBling Twitch:\nSethBling Facebook:\nSethBling Website:\nSethBling Shirts:\nSuggest Ideas:", "title": "BASIC Programming Language in Minecraft", "comments": [{"author": "ok", "content": "i made a redstone lamp once.", "replies": [{"author": "Fireboyev5 days ago", "content": "+Ikasu0 (二卡樹零) i crashed the game by setting the randomtick to 1000 :3"}]}, {"author": "Thegenfy", "content": "checks if April 1st", "replies": [{"author": "Nikola Milisic1 month ago", "content": "me too lol"}]}, {"author": "Jragon 014", "content": "Minecraft isn't a game anymore. It's a platform.", "replies": [{"author": "Андрей Беньковский1 day ago", "content": "+Jragon 014 There are two big issues with this platform: 1. terrible cpu clock speed, 2. different versions of the platform are so incompatible that the migration of a sufficiently complex program from one version to another is impractical. P.S. As long as we can hire a team of professionals to build a BASIC interpreter in every version of the Minecraft the 2nd issue is solvable at the cost of making the 1st issue worse."}]}, {"author": "xisumavoid", "content": "Does this have the potential to help kids learn to program? IE if it was directly applicable in the world like you showed the turtle? :-)\n\nEDIT: *minecraft world", "replies": [{"author": "Khronos1 month ago (edited)", "content": "BASIC is for children, I learned BASIC on Color Computer when I have 10 year old﻿ in 1986"}]}, {"author": "Awsisa zeen", "content": "I swear to god one day he will cure cancer using nothing but 2,129 command blocks.", "replies": [{"author": "Андрей Беньковский1 day ago", "content": "+Polaris R There is one problem. What if someone presses a button twice? Will it put two men on Mars? What if someone hooks the contraption to a pulse generator? Will it continue sending humans to Mars until there are no more humans left on the Earth?"}]}, {"author": "SeboTrzyDe3D", "content": "Yeah, in about 2 or 3 years we will be able to play games in Minecraft and in about 5, we will start calling Minecraft an actual Gaming Platform. Fallout 1 for Minecraft when?", "replies": [null]}, {"author": "Simbrine", "content": "Instead of killing your brain cells with the 1.8 commabd block system, you could've used the 1.9 snapshot system!", "replies": [{"author": "DᴀʀᴋYᴜᴀɴ1 month ago", "content": "+Simbrine Do MCEdit filters work with 1.9 command blocks yet?"}]}, {"author": "ZURATAMA1324", "content": "[2021: 5 years later]\n\"SethBling here. Today, I recreated the universe and reality itself on Minecraft.\"\n\n[2022: 1 year later]\n\"Of course, now that I created the universe, I also created intelligent human beings to live upon it.\"\n\"Phew, that was hard. Looks like I'll be taking a break for 1 year.\"", "replies": [{"author": "Elliott Belardo (ElliottBelardo2)2 weeks ago", "content": "[4038, many years later]\n\nWelcome back, SethBling here. Yes, I'm still alive. In the future, they build machines to make me immortal. The human beings living in my universe has managed to invent technology."}]}, {"author": "LetsPlayWouterGames", "content": "[2017]: Welcome back, SethBling here. Today I created Artificial Intelligence in Minecraft using command blocks.", "replies": [{"author": "Benjaminek Swart18 hours ago", "content": "while true do\nif\nplayerInRadius(5) then\nsay [\"Hi\"]\nend\nend\n\nThis is actulaly a AI"}]}, {"author": "nacoran", "content": "Instead of X-1 wouldn't 1/2 X be a better cutoff point for finding primes?  (Since no number can be evenly divided by a number greater than 1/2 itself?)  That would save some cycles, especially as the numbers get higher.\n\n-There are probably some other exclusions... I think there should be something to divide out.  I think maybe if you check a number for divisibility by two, then maybe no number greater than 1/3 and so on, but I don't know if that's actually true, it just seems like it might be and I don't know what to call it to Google it.", "replies": [{"author": "никита касумов1 week ago", "content": "+Connor Catlett X * X <= X is the best for performance. You should also do \"int xsq = X * X;\" to save the extra multiplication each iteration time and make that xsq <= X."}]}, {"author": "Gabriel Shaw", "content": "You should hold a contest of who can write the coolest programs.", "replies": [{"author": "MC ST0RMPEGASIS3 days ago", "content": "+Architector #4 Woops, Nevermind. You were right,"}]}, {"author": "Nathan55411", "content": "Now we need a command block that can calculate the answer to life the universe and everything.", "replies": [{"author": "Benjamin Dawkins1 day ago", "content": "+DanilaFoxPro Your script Fits: The Life goes on until you die (in this case run out of RAM)"}]}, {"author": "Robert Stafford", "content": "program Minecraft, but within a programmed version of Minecraft with this. #programception", "replies": [{"author": "RasRas3421 month ago", "content": "+Jimmy Loves Harley It is impossible to do it in real time. If it would work, the second Minecraft would run at less than 1 Billionth of an second per second."}]}, {"author": "Noah Orr", "content": "Wow what's next? A working cellphone in Minecraft?", "replies": [{"author": "Andrew U2 weeks ago", "content": "+SquidMannn | Redstone Master\nrage? dud..."}]}, {"author": "Computern", "content": "How Long before someone makes java inside minecraft and then writes minecraft that runs inside minecraft?", "replies": [{"author": "MC ST0RMPEGASIS3 days ago", "content": "20tps then 10tps then 5tps then 2tps then 1tps and then 1tp2\\s\n\nThe server would be really slow"}]}, {"author": "Agent M", "content": "would this be any faster in the snapshot (if it wouldnt break)", "replies": [{"author": "Connor Catlett1 month ago", "content": "10 times as fast still would be pretty slow. And the cap would be very low because of everything else Minecraft has to do every tick, even on faster computers."}]}, {"author": "wessltov", "content": "Seth, you insane, insane man!", "replies": [null]}, {"author": "kakoka1pro", "content": "make flash games using minecraft!\nalso make agar io nevermind", "replies": [{"author": "SuperGamersgames1 month ago", "content": "+kakoka1pro he already made agario"}]}, {"author": "werebox3333", "content": "Next step: ASM in Minecraft", "replies": [null]}, {"author": "Roman Anonymous", "content": "Isn't it technically possible to write the code for minecraft in minecraft, and create this inside?", "replies": [{"author": "Hoo Nowz3 days ago", "content": "+MC ST0RMPEGASIS no, it would be impossible. you just can't with that language"}]}]}